Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
       }
        }
+       stage {
+           name = "Deploy"

+           action {
+               category        = "Deploy"
+               configuration   = {
+                   "AppSpecTemplateArtifact"        = "BuildArt"
+                   "AppSpecTemplatePath"            = "appspec.yaml"
+                   "ApplicationName"                = "myproject-staging-ecs-app"
+                   "DeploymentGroupName"            = "myproject-staging-ecs-deployment-group"
+                   "TaskDefinitionTemplateArtifact" = "BuildArt"
+                   "TaskDefinitionTemplatePath"     = "taskdef.json"
                }
+               input_artifacts = [
+                   "BuildArt",
                ]
+               name            = "Deploy"
+               owner           = "AWS"
+               provider        = "CodeDeployToECS"
+               region          = (known after apply)
+               run_order       = (known after apply)
+               version         = "1"
            }
        }

+       trigger (known after apply)
    }

  # aws_codestarconnections_connection.github_connection will be created
+   resource "aws_codestarconnections_connection" "github_connection" {
+       arn               = (known after apply)
+       connection_status = (known after apply)
+       id                = (known after apply)
+       name              = "github-connection"
+       provider_type     = "GitHub"
+       tags_all          = (known after apply)
    }

  # aws_ecr_repository.app_repository will be created
+   resource "aws_ecr_repository" "app_repository" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "MUTABLE"
+       name                 = "myproject-staging-app"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = (known after apply)
    }

  # aws_ecs_cluster.this will be created
+   resource "aws_ecs_cluster" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "myproject-staging"
+       tags_all = (known after apply)

+       setting (known after apply)
    }

  # aws_ecs_service.this will be created
+   resource "aws_ecs_service" "this" {
+       availability_zone_rebalancing      = "DISABLED"
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 2
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "myproject-staging"
+       platform_version                   = "1.4.0"
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       deployment_controller {
+           type = "CODE_DEPLOY"
        }

+       load_balancer {
+           container_name   = "myproject-staging-app"
+           container_port   = 8080
+           target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = (known after apply)
+           subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.this will be created
+   resource "aws_ecs_task_definition" "this" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (known after apply)
+       cpu                      = "256"
+       execution_role_arn       = (known after apply)
+       family                   = "myproject-staging"
+       id                       = (known after apply)
+       memory                   = "512"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = (known after apply)
+       task_role_arn            = (known after apply)
+       track_latest             = false

+       volume {
+           configure_at_launch = (known after apply)
+           name                = "efs"
            # (1 unchanged attribute hidden)

+           efs_volume_configuration {
+               file_system_id          = (known after apply)
+               root_directory          = "/"
+               transit_encryption_port = 0
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_efs_file_system.this will be created
+   resource "aws_efs_file_system" "this" {
+       arn                     = (known after apply)
+       availability_zone_id    = (known after apply)
+       availability_zone_name  = (known after apply)
+       creation_token          = "myproject-staging"
+       dns_name                = (known after apply)
+       encrypted               = true
+       id                      = (known after apply)
+       kms_key_id              = (known after apply)
+       name                    = (known after apply)
+       number_of_mount_targets = (known after apply)
+       owner_id                = (known after apply)
+       performance_mode        = (known after apply)
+       size_in_bytes           = (known after apply)
+       tags                    = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all                = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       throughput_mode         = "bursting"

+       protection (known after apply)
    }

  # aws_efs_mount_target.this[0] will be created
+   resource "aws_efs_mount_target" "this" {
+       availability_zone_id   = (known after apply)
+       availability_zone_name = (known after apply)
+       dns_name               = (known after apply)
+       file_system_arn        = (known after apply)
+       file_system_id         = (known after apply)
+       id                     = (known after apply)
+       ip_address             = (known after apply)
+       mount_target_dns_name  = (known after apply)
+       network_interface_id   = (known after apply)
+       owner_id               = (known after apply)
+       security_groups        = (known after apply)
+       subnet_id              = (known after apply)
    }

  # aws_efs_mount_target.this[1] will be created
+   resource "aws_efs_mount_target" "this" {
+       availability_zone_id   = (known after apply)
+       availability_zone_name = (known after apply)
+       dns_name               = (known after apply)
+       file_system_arn        = (known after apply)
+       file_system_id         = (known after apply)
+       id                     = (known after apply)
+       ip_address             = (known after apply)
+       mount_target_dns_name  = (known after apply)
+       network_interface_id   = (known after apply)
+       owner_id               = (known after apply)
+       security_groups        = (known after apply)
+       subnet_id              = (known after apply)
    }

  # aws_iam_policy.task_execution_policy will be created
+   resource "aws_iam_policy" "task_execution_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ecr:GetAuthorizationToken",
+                           "ecr:BatchCheckLayerAvailability",
+                           "ecr:GetDownloadUrlForLayer",
+                           "ecr:BatchGetImage",
+                           "elasticfilesystem:ClientMount",
+                           "elasticfilesystem:ClientWrite",
+                           "logs:CreateLogStream",
+                           "logs:PutLogEvents",
+                           "ssm:GetParameters",
+                           "kms:Decrypt",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = (known after apply)
    }

  # aws_iam_policy.task_policy will be created
+   resource "aws_iam_policy" "task_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       id               = (known after apply)
+       name             = (known after apply)
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "elasticfilesystem:ClientMount",
+                           "elasticfilesystem:ClientWrite",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id        = (known after apply)
+       tags_all         = (known after apply)
    }

  # aws_iam_role.codebuild_role will be created
+   resource "aws_iam_role" "codebuild_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "myproject-staging-codebuild-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role.codedeploy_role will be created
+   resource "aws_iam_role" "codedeploy_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "myproject-staging-codedeploy-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role.codepipeline_role will be created
+   resource "aws_iam_role" "codepipeline_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "codepipeline.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "myproject-staging-codepipeline-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role.task_execution_role will be created
+   resource "aws_iam_role" "task_execution_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = [
+                               "ecs-tasks.amazonaws.com",
                            ]
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "myproject-task-execution-role-staging"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all              = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role.task_role will be created
+   resource "aws_iam_role" "task_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = [
+                               "ecs-tasks.amazonaws.com",
                            ]
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "myproject-task-role-staging"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all              = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role_policy.codebuild_policy will be created
+   resource "aws_iam_role_policy" "codebuild_policy" {
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = (known after apply)
+       policy      = (known after apply)
+       role        = (known after apply)
    }

  # aws_iam_role_policy.codedeploy_policy will be created
+   resource "aws_iam_role_policy" "codedeploy_policy" {
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = (known after apply)
+       policy      = (known after apply)
+       role        = (known after apply)
    }

  # aws_iam_role_policy.codepipeline_policy will be created
+   resource "aws_iam_role_policy" "codepipeline_policy" {
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = (known after apply)
+       policy      = (known after apply)
+       role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.task_execution_policy_attach will be created
+   resource "aws_iam_role_policy_attachment" "task_execution_policy_attach" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "myproject-task-execution-role-staging"
    }

  # aws_iam_role_policy_attachment.task_policy_attach will be created
+   resource "aws_iam_role_policy_attachment" "task_policy_attach" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "myproject-task-role-staging"
    }

  # aws_lb_listener.https will be created
+   resource "aws_lb_listener" "https" {
+       arn                      = (known after apply)
+       certificate_arn          = (known after apply)
+       id                       = (known after apply)
+       load_balancer_arn        = (known after apply)
+       port                     = 443
+       protocol                 = "HTTPS"
+       ssl_policy               = "ELBSecurityPolicy-2016-08"
+       tags_all                 = (known after apply)
+       tcp_idle_timeout_seconds = (known after apply)

+       default_action {
+           order = (known after apply)
+           type  = "fixed-response"

+           fixed_response {
+               content_type = "text/plain"
+               message_body = "unauthorized"
+               status_code  = "403"
            }
        }

+       mutual_authentication (known after apply)
    }

  # aws_lb_listener_rule.app will be created
+   resource "aws_lb_listener_rule" "app" {
+       arn          = (known after apply)
+       id           = (known after apply)
+       listener_arn = (known after apply)
+       priority     = 100
+       tags_all     = (known after apply)

+       action {
+           order = (known after apply)
+           type  = "forward"

+           forward {
+               target_group {
+                   arn    = (known after apply)
+                   weight = 0
                }
+               target_group {
+                   arn    = (known after apply)
+                   weight = 1
                }
            }
        }

+       condition {
+           host_header {
+               values = [
+                   "myapp.sevira.cloud",
                ]
            }
        }
    }

  # aws_lb_target_group.blue will be created
+   resource "aws_lb_target_group" "blue" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancer_arns                 = (known after apply)
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_anomaly_mitigation  = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "myproject-staging-blue-tg"
+       name_prefix                        = (known after apply)
+       port                               = 8080
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = (known after apply)
+       target_type                        = "ip"
+       vpc_id                             = (known after apply)

+       health_check {
+           enabled             = true
+           healthy_threshold   = 3
+           interval            = 30
+           matcher             = "200"
+           path                = "/"
+           port                = "traffic-port"
+           protocol            = "HTTP"
+           timeout             = (known after apply)
+           unhealthy_threshold = 3
        }

+       stickiness (known after apply)

+       target_failover (known after apply)

+       target_group_health (known after apply)

+       target_health_state (known after apply)
    }

  # aws_lb_target_group.green will be created
+   resource "aws_lb_target_group" "green" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancer_arns                 = (known after apply)
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_anomaly_mitigation  = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "myproject-staging-green-tg"
+       name_prefix                        = (known after apply)
+       port                               = 8080
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = (known after apply)
+       target_type                        = "ip"
+       vpc_id                             = (known after apply)

+       health_check {
+           enabled             = true
+           healthy_threshold   = 3
+           interval            = 30
+           matcher             = "200"
+           path                = "/"
+           port                = "traffic-port"
+           protocol            = "HTTP"
+           timeout             = (known after apply)
+           unhealthy_threshold = 3
        }

+       stickiness (known after apply)

+       target_failover (known after apply)

+       target_group_health (known after apply)

+       target_health_state (known after apply)
    }

  # aws_route53_record.app will be created
+   resource "aws_route53_record" "app" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "myapp.sevira.cloud"
+       type            = "A"
+       zone_id         = "Z02136633A0BUJO7ZT4W7"

+       alias {
+           evaluate_target_health = true
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.codepipeline_bucket_pab will be created
+   resource "aws_s3_bucket_public_access_block" "codepipeline_bucket_pab" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # aws_security_group.alb will be created
+   resource "aws_security_group" "alb" {
+       arn                    = (known after apply)
+       description            = "Allow HTTPS inbound traffc - ALB"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
                # (1 unchanged attribute hidden)
            },
+           {
+               cidr_blocks      = []
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = true
+               to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
+       name                   = "myproject-alb-staging"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all               = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.app will be created
+   resource "aws_security_group" "app" {
+       arn                    = (known after apply)
+       description            = "Allow ALL inbound traffc from ALB SG"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
+       name                   = "myproject-app-staging"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all               = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.efs will be created
+   resource "aws_security_group" "efs" {
+       arn                    = (known after apply)
+       description            = "Allow traffic from Fargate"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 2049
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 2049
                # (1 unchanged attribute hidden)
            },
        ]
+       name                   = "myproject-efs-staging"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all               = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_vpc_endpoint.s3_gw_endpoint will be created
+   resource "aws_vpc_endpoint" "s3_gw_endpoint" {
+       arn                   = (known after apply)
+       cidr_blocks           = (known after apply)
+       dns_entry             = (known after apply)
+       id                    = (known after apply)
+       ip_address_type       = (known after apply)
+       network_interface_ids = (known after apply)
+       owner_id              = (known after apply)
+       policy                = (known after apply)
+       prefix_list_id        = (known after apply)
+       private_dns_enabled   = (known after apply)
+       requester_managed     = (known after apply)
+       route_table_ids       = (known after apply)
+       security_group_ids    = (known after apply)
+       service_name          = "com.amazonaws.us-east-2.s3"
+       state                 = (known after apply)
+       subnet_ids            = (known after apply)
+       tags                  = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all              = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_endpoint_type     = "Gateway"
+       vpc_id                = (known after apply)

+       dns_options (known after apply)

+       subnet_configuration (known after apply)
    }

  # module.acm.aws_acm_certificate.this[0] will be created
+   resource "aws_acm_certificate" "this" {
+       arn                       = (known after apply)
+       domain_name               = "myapp.sevira.cloud"
+       domain_validation_options = [
+           {
+               domain_name           = "myapp.sevira.cloud"
+               resource_record_name  = (known after apply)
+               resource_record_type  = (known after apply)
+               resource_record_value = (known after apply)
            },
        ]
+       id                        = (known after apply)
+       key_algorithm             = (known after apply)
+       not_after                 = (known after apply)
+       not_before                = (known after apply)
+       pending_renewal           = (known after apply)
+       renewal_eligibility       = (known after apply)
+       renewal_summary           = (known after apply)
+       status                    = (known after apply)
+       subject_alternative_names = [
+           "myapp.sevira.cloud",
        ]
+       tags                      = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all                  = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       type                      = (known after apply)
+       validation_emails         = (known after apply)
+       validation_method         = "DNS"

+       options {
+           certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm.aws_acm_certificate_validation.this[0] will be created
+   resource "aws_acm_certificate_validation" "this" {
+       certificate_arn         = (known after apply)
+       id                      = (known after apply)
+       validation_record_fqdns = (known after apply)

+       timeouts {}
    }

  # module.acm.aws_route53_record.validation[0] will be created
+   resource "aws_route53_record" "validation" {
+       allow_overwrite = true
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = (known after apply)
+       records         = (known after apply)
+       ttl             = 60
+       type            = (known after apply)
+       zone_id         = (known after apply)
    }

  # module.alb.aws_lb.this[0] will be created
+   resource "aws_lb" "this" {
+       arn                                                          = (known after apply)
+       arn_suffix                                                   = (known after apply)
+       client_keep_alive                                            = 3600
+       desync_mitigation_mode                                       = "defensive"
+       dns_name                                                     = (known after apply)
+       drop_invalid_header_fields                                   = true
+       enable_deletion_protection                                   = false
+       enable_http2                                                 = true
+       enable_tls_version_and_cipher_suite_headers                  = false
+       enable_waf_fail_open                                         = false
+       enable_xff_client_port                                       = false
+       enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
+       id                                                           = (known after apply)
+       idle_timeout                                                 = 60
+       internal                                                     = (known after apply)
+       ip_address_type                                              = (known after apply)
+       load_balancer_type                                           = "application"
+       name                                                         = "myproject-staging"
+       name_prefix                                                  = (known after apply)
+       preserve_host_header                                         = false
+       security_groups                                              = (known after apply)
+       subnets                                                      = (known after apply)
+       tags                                                         = {
+           "Env"                   = "staging"
+           "Owner"                 = "DevOps Team"
+           "Terraform"             = "true"
+           "terraform-aws-modules" = "alb"
        }
+       tags_all                                                     = {
+           "Env"                   = "staging"
+           "Owner"                 = "DevOps Team"
+           "Terraform"             = "true"
+           "terraform-aws-modules" = "alb"
        }
+       vpc_id                                                       = (known after apply)
+       xff_header_processing_mode                                   = "append"
+       zone_id                                                      = (known after apply)

+       subnet_mapping (known after apply)

+       timeouts {}
    }

  # module.alb.aws_security_group.this[0] will be created
+   resource "aws_security_group" "this" {
+       arn                    = (known after apply)
+       description            = "Security group for myproject-staging application load balancer"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "myproject-staging-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Env"                   = "staging"
+           "Owner"                 = "DevOps Team"
+           "Terraform"             = "true"
+           "terraform-aws-modules" = "alb"
        }
+       tags_all               = {
+           "Env"                   = "staging"
+           "Owner"                 = "DevOps Team"
+           "Terraform"             = "true"
+           "terraform-aws-modules" = "alb"
        }
+       vpc_id                 = (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "myproject-staging-codepipeline-bucket"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = false
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all                    = {
+           "Env"       = "staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
+   resource "aws_s3_bucket_public_access_block" "this" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.s3_bucket.aws_s3_bucket_versioning.this[0] will be created
+   resource "aws_s3_bucket_versioning" "this" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Suspended"
        }
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-default"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all               = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-default"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
            # (1 unchanged attribute hidden)
        }
+       egress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
            # (1 unchanged attribute hidden)
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
            # (1 unchanged attribute hidden)
        }
+       ingress {
+           action          = "allow"
+           cidr_block      = "0.0.0.0/0"
+           from_port       = 0
+           protocol        = "-1"
+           rule_no         = 100
+           to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-default"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all               = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-default"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-default"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all               = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-default"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       ipam_pool_id         = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-us-east-2a"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all             = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-us-east-2a"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_eip.nat[1] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       ipam_pool_id         = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-us-east-2b"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all             = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-us-east-2b"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc                  = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-us-east-2a"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all                           = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-us-east-2a"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-us-east-2b"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all                           = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-us-east-2b"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-private-us-east-2a"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all         = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-private-us-east-2a"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-private-us-east-2b"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all         = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-private-us-east-2b"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-public"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all         = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-public"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.64.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-private-us-east-2a"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all                                       = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-private-us-east-2a"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.80.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-private-us-east-2b"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all                                       = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-private-us-east-2b"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.32.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-public-us-east-2a"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all                                       = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-public-us-east-2a"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-2b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.1.48.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-public-us-east-2b"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all                                       = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging-public-us-east-2b"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.1.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
+       tags_all                             = {
+           "Env"       = "staging"
+           "Name"      = "myproject-staging"
+           "Owner"     = "DevOps Team"
+           "Terraform" = "true"
        }
    }

Plan: 71 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   route53_record_fqdn = (known after apply)
+   s3_bucket_arn       = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p ecs-with-fargate-and-cicd
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.sevira.cloud/lock?id=paulofponciano%252Fecs-with-fargate-and-cicd%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p ecs-with-fargate-and-cicd
  ```
Plan: 71 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```